---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures
source: html/b359fd82-5bf1-b5a5-babe-c5670b4792a7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures

Failures about Revolution.

## Syntax (C#)
```csharp
public static class RevolutionFailures
```